littlekernel/lk/external/platform/cc13xx/cc13xxware/inc/hw_adi_0_rf.h
// Field:     [4] ATEST_V_EN
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_RFLDO0_ATEST_V_EN                                  0x00000010
#define ADI_0_RF_RFLDO0_ATEST_V_EN_BITN                                      4
#define ADI_0_RF_RFLDO0_ATEST_V_EN_M                                0x00000010
#define ADI_0_RF_RFLDO0_ATEST_V_EN_S                                         4

// Field:     [3] BYPASS_REG_EN
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_RFLDO0_BYPASS_REG_EN                               0x00000008
#define ADI_0_RF_RFLDO0_BYPASS_REG_EN_BITN                                   3
#define ADI_0_RF_RFLDO0_BYPASS_REG_EN_M                             0x00000008
#define ADI_0_RF_RFLDO0_BYPASS_REG_EN_S                                      3

// Field:     [2] RDY_EN
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// EN                       Internal. Only to be used through TI provided API.
// DIS                      Internal. Only to be used through TI provided API.
#define ADI_0_RF_RFLDO0_RDY_EN                                      0x00000004
#define ADI_0_RF_RFLDO0_RDY_EN_BITN                                          2
#define ADI_0_RF_RFLDO0_RDY_EN_M                                    0x00000004
#define ADI_0_RF_RFLDO0_RDY_EN_S                                             2
#define ADI_0_RF_RFLDO0_RDY_EN_EN                                   0x00000004
#define ADI_0_RF_RFLDO0_RDY_EN_DIS                                  0x00000000

// Field:     [1] BIAS_DIS
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// DIS                      Internal. Only to be used through TI provided API.
// EN                       Internal. Only to be used through TI provided API.
#define ADI_0_RF_RFLDO0_BIAS_DIS                                    0x00000002
#define ADI_0_RF_RFLDO0_BIAS_DIS_BITN                                        1
#define ADI_0_RF_RFLDO0_BIAS_DIS_M                                  0x00000002
#define ADI_0_RF_RFLDO0_BIAS_DIS_S                                           1
#define ADI_0_RF_RFLDO0_BIAS_DIS_DIS                                0x00000002
#define ADI_0_RF_RFLDO0_BIAS_DIS_EN                                 0x00000000

// Field:     [0] EN
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// EN                       Internal. Only to be used through TI provided API.
// DIS                      Internal. Only to be used through TI provided API.
#define ADI_0_RF_RFLDO0_EN                                          0x00000001
#define ADI_0_RF_RFLDO0_EN_BITN                                              0
#define ADI_0_RF_RFLDO0_EN_M                                        0x00000001
#define ADI_0_RF_RFLDO0_EN_S                                                 0
#define ADI_0_RF_RFLDO0_EN_EN                                       0x00000001
#define ADI_0_RF_RFLDO0_EN_DIS                                      0x00000000

//*****************************************************************************
//
// Register: ADI_0_RF_O_RFLDO1
//
//*****************************************************************************
// Field:   [6:0] TRIM_OUT
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_RFLDO1_TRIM_OUT_W                                           7
#define ADI_0_RF_RFLDO1_TRIM_OUT_M                                  0x0000007F
#define ADI_0_RF_RFLDO1_TRIM_OUT_S                                           0

//*****************************************************************************
//
// Register: ADI_0_RF_O_RFLDO2
//
//*****************************************************************************
// Field:   [5:3] COMP_RES
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_RFLDO2_COMP_RES_W                                           3
#define ADI_0_RF_RFLDO2_COMP_RES_M                                  0x00000038
#define ADI_0_RF_RFLDO2_COMP_RES_S                                           3

// Field:   [2:0] COMP_CAP
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_RFLDO2_COMP_CAP_W                                           3
#define ADI_0_RF_RFLDO2_COMP_CAP_M                                  0x00000007
#define ADI_0_RF_RFLDO2_COMP_CAP_S                                           0

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFADCCTL0
//
//*****************************************************************************
// Field:   [7:4] INT2ADJ
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFADCCTL0_INT2ADJ_W                                         4
#define ADI_0_RF_IFADCCTL0_INT2ADJ_M                                0x000000F0
#define ADI_0_RF_IFADCCTL0_INT2ADJ_S                                         4

// Field:   [3:2] AAFCAP
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFADCCTL0_AAFCAP_W                                          2
#define ADI_0_RF_IFADCCTL0_AAFCAP_M                                 0x0000000C
#define ADI_0_RF_IFADCCTL0_AAFCAP_S                                          2

// Field:     [1] BIAS_DIS
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// DIS                      Internal. Only to be used through TI provided API.
// EN                       Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFADCCTL0_BIAS_DIS                                 0x00000002
#define ADI_0_RF_IFADCCTL0_BIAS_DIS_BITN                                     1
#define ADI_0_RF_IFADCCTL0_BIAS_DIS_M                               0x00000002
#define ADI_0_RF_IFADCCTL0_BIAS_DIS_S                                        1
#define ADI_0_RF_IFADCCTL0_BIAS_DIS_DIS                             0x00000002
#define ADI_0_RF_IFADCCTL0_BIAS_DIS_EN                              0x00000000

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFADCLFCFG0
//
//*****************************************************************************
// Field:   [7:4] FF1ADJ
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFADCLFCFG0_FF1ADJ_W                                        4
#define ADI_0_RF_IFADCLFCFG0_FF1ADJ_M                               0x000000F0
#define ADI_0_RF_IFADCLFCFG0_FF1ADJ_S                                        4

