littlekernel/lk/external/platform/cc13xx/cc13xxware/inc/hw_adi_0_rf.h
// Field:   [3:0] INT3ADJ
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFADCLFCFG0_INT3ADJ_W                                       4
#define ADI_0_RF_IFADCLFCFG0_INT3ADJ_M                              0x0000000F
#define ADI_0_RF_IFADCLFCFG0_INT3ADJ_S                                       0

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFADCLFCFG1
//
//*****************************************************************************
// Field:   [7:4] FF3ADJ
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFADCLFCFG1_FF3ADJ_W                                        4
#define ADI_0_RF_IFADCLFCFG1_FF3ADJ_M                               0x000000F0
#define ADI_0_RF_IFADCLFCFG1_FF3ADJ_S                                        4

// Field:   [3:0] FF2ADJ
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFADCLFCFG1_FF2ADJ_W                                        4
#define ADI_0_RF_IFADCLFCFG1_FF2ADJ_M                               0x0000000F
#define ADI_0_RF_IFADCLFCFG1_FF2ADJ_S                                        0

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFADCDAC
//
//*****************************************************************************
// Field:     [7] MODE
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// RTZ                      Internal. Only to be used through TI provided API.
// NRTZ                     Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFADCDAC_MODE                                      0x00000080
#define ADI_0_RF_IFADCDAC_MODE_BITN                                          7
#define ADI_0_RF_IFADCDAC_MODE_M                                    0x00000080
#define ADI_0_RF_IFADCDAC_MODE_S                                             7
#define ADI_0_RF_IFADCDAC_MODE_RTZ                                  0x00000080
#define ADI_0_RF_IFADCDAC_MODE_NRTZ                                 0x00000000

// Field:   [6:1] TRIM
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFADCDAC_TRIM_W                                             6
#define ADI_0_RF_IFADCDAC_TRIM_M                                    0x0000007E
#define ADI_0_RF_IFADCDAC_TRIM_S                                             1

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFADCQUANT0
//
//*****************************************************************************
// Field:     [3] AUTOCAL_EN
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFADCQUANT0_AUTOCAL_EN                             0x00000008
#define ADI_0_RF_IFADCQUANT0_AUTOCAL_EN_BITN                                 3
#define ADI_0_RF_IFADCQUANT0_AUTOCAL_EN_M                           0x00000008
#define ADI_0_RF_IFADCQUANT0_AUTOCAL_EN_S                                    3

// Field:   [2:0] TH
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFADCQUANT0_TH_W                                            3
#define ADI_0_RF_IFADCQUANT0_TH_M                                   0x00000007
#define ADI_0_RF_IFADCQUANT0_TH_S                                            0

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFADCCTL1
//
//*****************************************************************************
// Field:   [7:5] DITHERTRIM
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFADCCTL1_DITHERTRIM_W                                      3
#define ADI_0_RF_IFADCCTL1_DITHERTRIM_M                             0x000000E0
#define ADI_0_RF_IFADCCTL1_DITHERTRIM_S                                      5

// Field:     [4] ADCIEN
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// EN                       Internal. Only to be used through TI provided API.
// DIS                      Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFADCCTL1_ADCIEN                                   0x00000010
#define ADI_0_RF_IFADCCTL1_ADCIEN_BITN                                       4
#define ADI_0_RF_IFADCCTL1_ADCIEN_M                                 0x00000010
#define ADI_0_RF_IFADCCTL1_ADCIEN_S                                          4
#define ADI_0_RF_IFADCCTL1_ADCIEN_EN                                0x00000010
#define ADI_0_RF_IFADCCTL1_ADCIEN_DIS                               0x00000000

// Field:     [3] ADCQEN
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// EN                       Internal. Only to be used through TI provided API.
// DIS                      Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFADCCTL1_ADCQEN                                   0x00000008
#define ADI_0_RF_IFADCCTL1_ADCQEN_BITN                                       3
#define ADI_0_RF_IFADCCTL1_ADCQEN_M                                 0x00000008
#define ADI_0_RF_IFADCCTL1_ADCQEN_S                                          3
#define ADI_0_RF_IFADCCTL1_ADCQEN_EN                                0x00000008
#define ADI_0_RF_IFADCCTL1_ADCQEN_DIS                               0x00000000

// Field:   [2:1] DITHEREN
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// ENG                      Internal. Only to be used through TI provided API.
// ENSD                     Internal. Only to be used through TI provided API.
// ENS                      Internal. Only to be used through TI provided API.
// DIS                      Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFADCCTL1_DITHEREN_W                                        2
#define ADI_0_RF_IFADCCTL1_DITHEREN_M                               0x00000006
#define ADI_0_RF_IFADCCTL1_DITHEREN_S                                        1
#define ADI_0_RF_IFADCCTL1_DITHEREN_ENG                             0x00000006
#define ADI_0_RF_IFADCCTL1_DITHEREN_ENSD                            0x00000004
#define ADI_0_RF_IFADCCTL1_DITHEREN_ENS                             0x00000002
#define ADI_0_RF_IFADCCTL1_DITHEREN_DIS                             0x00000000

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFADCCTL2
//
//*****************************************************************************
// Field:     [7] RESETN
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// DIS                      Internal. Only to be used through TI provided API.
// EN                       Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFADCCTL2_RESETN                                   0x00000080
#define ADI_0_RF_IFADCCTL2_RESETN_BITN                                       7
#define ADI_0_RF_IFADCCTL2_RESETN_M                                 0x00000080
#define ADI_0_RF_IFADCCTL2_RESETN_S                                          7
#define ADI_0_RF_IFADCCTL2_RESETN_DIS                               0x00000080
#define ADI_0_RF_IFADCCTL2_RESETN_EN                                0x00000000

